# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr


# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1, 1, 1024]

# r18 backbone
backbone:
  # [from, repeats, module, args] # input (320*320*3)
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] # 0-P1/2 (160*160*32)
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] # 1 (160*160*32)
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']] # 2 (160*160*64)
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4                   (160*160*64)
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4  output (80*80*64)
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8 output (40*40*128)
  - [-1, 1, TrapezoidConv, [128, 4, 1]] # 5-P4/16       # 6: output (40*40*128)
  - [-1, 1, Blocks, [128, BasicBlock, 2, 4, 'relu']] # 7-P4/16 output (20*20*256)
  - [-1, 1, TrapezoidConv, [256, 4, 1]] # 5-P4/16       # 8: output (20*20*256)
  - [-1, 1, C3k2, [256, True]]                         # 9: output (20*20*256)
  - [-1, 1, SPPF, [256, 5]] # 9                        # 10: output (20*20*256)
  - [-1, 1, C2PSA, [256]] # 10                         # 11: output (20*20*256)

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 12: output (40*40*256)
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4         # 13: output (40*40*384)
  - [-1, 1, C3k2, [128, False]] # 13                    # 14: output (40*40*128)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 15: output (80*80*128)
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3         # 16: output (80*80*192)
  - [-1, 1, C3k2, [64, False]] # 16 (P3/8-small)       # 17: output (80*80*64)

  - [-1, 1, Conv, [64, 3, 2]]                          # 18: output (40*40*64)
  - [[-1, 14], 1, Concat, [1]] # cat head P4            # 19: output (40*40*192)
  - [-1, 1, C3k2, [128, False]] # 19 (P4/16-medium)     # 20: output (40*40*128)

  - [-1, 1, Conv, [128, 3, 2]]                          # 21: output (20*20*128)
  - [[-1, 11], 1, Concat, [1]] # cat head P5            # 22: output (20*20*384)
  - [-1, 1, C3k2, [256, True]] # 22 (P5/32-large)      # 23: output (20*20*256)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)

# 340 layers, 2,598,445 parameters, 2,598,429 gradients, 6.5 GFLOPs
